In [1]:
# Pandas  ==>  It is an open source library thar is used for handle data manipulations.

# Data structure of pandas 
# (1).Series   ==> It is one -dimensional array . It contains only values not column name.

# (2).DataFrame ==> It is multi-dimensional array.. It contain values with column name

In [1]:
import pandas as pd

# Series

In [3]:
a = pd.Series([10,20,30,40,50,60])
a

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

# DataFrame

In [8]:
a = {
    "Emp_id": [1,2,3,4,5,6,7,8],
    "Name": ["Sam","Raj","Nidhi","Deepak","Sam","mahak","garvit","Sam"],
    "Department": ["IT","Sales","IT","IT","Sales","IT","Operatios","Sales"],
    "Working_hour":[8,9,9,9,8,9,8,8]

}
type(a)

dict

In [10]:
df = pd.DataFrame(a)
df

   Emp_id    Name Department  Working_hour
0       1     Sam         IT             8
1       2     Raj      Sales             9
2       3   Nidhi         IT             9
3       4  Deepak         IT             9
4       5     Sam      Sales             8
5       6   mahak         IT             9
6       7  garvit  Operatios             8
7       8     Sam      Sales             8

# How can we import or export our dataframe ?

In [11]:
# create csv  file(export krna) 


df.to_csv("C:\\Users\\91937\\OneDrive\\Desktop\\Dataframe\\emp_info.csv",index=False)
# df.to_csv("C:\\Users\\91937\\OneDrive\\Desktop\\Dataframe\\e1.csv",index=False)

In [12]:
# Read file (import file)

df1 = pd.read_csv("C:\\Users\\91937\\OneDrive\\Desktop\\Dataframe\\emp_info.csv")

In [13]:
df1

   Emp_id    Name Department  Working_hour
0       1     Sam         IT             8
1       2     Raj      Sales             9
2       3   Nidhi         IT             9
3       4  Deepak         IT             9
4       5     Sam      Sales             8
5       6   mahak         IT             9
6       7  garvit  Operatios             8
7       8     Sam      Sales             8

In [19]:
# create  excel file  file(export krna) 


df.to_excel("C:\\Users\\91937\\OneDrive\\Desktop\\Dataframe\\emp_new_info.xlsx",index=False)

# How can we check top 5 data?

In [21]:
df

   Emp_id    Name Department  Working_hour
0       1     Sam         IT             8
1       2     Raj      Sales             9
2       3   Nidhi         IT             9
3       4  Deepak         IT             9
4       5     Sam      Sales             8
5       6   mahak         IT             9
6       7  garvit  Operatios             8
7       8     Sam      Sales             8

In [20]:
# .head() ==> by default 5 row

df.head()

   Emp_id    Name Department  Working_hour
0       1     Sam         IT             8
1       2     Raj      Sales             9
2       3   Nidhi         IT             9
3       4  Deepak         IT             9
4       5     Sam      Sales             8

In [14]:
df.head(2)                 # check many  row of data

   Emp_id Name Department  Working_hour
0       1  Sam         IT             8
1       2  Raj      Sales             9

# How Can We Check Bottom  Data?

In [23]:
df.tail()      # By default give 5 row of data

   Emp_id    Name Department  Working_hour
3       4  Deepak         IT             9
4       5     Sam      Sales             8
5       6   mahak         IT             9
6       7  garvit  Operatios             8
7       8     Sam      Sales             8

In [24]:
df.tail(2)

   Emp_id    Name Department  Working_hour
6       7  garvit  Operatios             8
7       8     Sam      Sales             8

# How Can We Check Random Indexed Data?

In [17]:
df.sample()           # By default 1

   Emp_id    Name Department  Working_hour
3       4  Deepak         IT             9

In [21]:
df.sample(2)

   Emp_id    Name Department  Working_hour
5       6   mahak         IT             9
3       4  Deepak         IT             9

# How Can We Check Total Shape Of Data?

In [39]:
df.shape                 # Define how many row and column (row,column)

(8, 4)

# Case -1

You have to update "nidhi" to "Aditi"  and "raj" to "rajat" ?

In [41]:
df["Name"]

0       Sam
1       Raj
2     Nidhi
3    Deepak
4       Sam
5     mahak
6    garvit
7       Sam
Name: Name, dtype: object

In [44]:
df["Name"][2] = "Aditi"
df

C:\Users\91937\AppData\Local\Temp\ipykernel_10704\2385277339.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Name"][2] = "Aditi"
C:\Users\91937\AppData\Local\Temp\ipykernel_10704\2385277339.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Name"][2] = "Aditi"

   Emp_id    Name Department  Working_hour
0       1     Sam         IT             8
1       2     Raj      Sales             9
2       3   Aditi         IT             9
3       4  Deepak         IT             9
4       5     Sam      Sales             8
5       6   mahak         IT             9
6       7  garvit  Operatios             8
7       8     Sam      Sales             8

In [45]:
df["Name"][1] = "Rajat"

C:\Users\91937\AppData\Local\Temp\ipykernel_10704\3782014207.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Name"][1] = "Rajat"
C:\Users\91937\AppData\Local\Temp\ipykernel_10704\3782014207.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Name"][1] = "Rajat"

In [46]:
df

   Emp_id    Name Department  Working_hour
0       1     Sam         IT             8
1       2   Rajat      Sales             9
2       3   Aditi         IT             9
3       4  Deepak         IT             9
4       5     Sam      Sales             8
5       6   mahak         IT             9
6       7  garvit  Operatios             8
7       8     Sam      Sales             8

# How Can We Check Total Sub_Categories Frequency of a column ?

In [47]:
df["Name"].value_counts()

Name
Sam       3
Rajat     1
Aditi     1
Deepak    1
mahak     1
garvit    1
Name: count, dtype: int64

In [50]:
df["Department"].value_counts()

Department
IT           4
Sales        3
Operatios    1
Name: count, dtype: int64

# How Can We Handle Missing Data?

In [51]:
df.isnull().sum()

Emp_id          0
Name            0
Department      0
Working_hour    0
dtype: int64

In [52]:
df

   Emp_id    Name Department  Working_hour
0       1     Sam         IT             8
1       2   Rajat      Sales             9
2       3   Aditi         IT             9
3       4  Deepak         IT             9
4       5     Sam      Sales             8
5       6   mahak         IT             9
6       7  garvit  Operatios             8
7       8     Sam      Sales             8

In [53]:
df["Name"][1] = None
df["Department"][5] = None

C:\Users\91937\AppData\Local\Temp\ipykernel_10704\1453643092.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Name"][1] = None
C:\Users\91937\AppData\Local\Temp\ipykernel_10704\1453643092.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Name"][1] = None
C:\Users\91937\AppData\Local\Temp\ipykernel_10704\1453643092.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Department"][5] = None

In [54]:
df

   Emp_id    Name Department  Working_hour
0       1     Sam         IT             8
1       2    None      Sales             9
2       3   Aditi         IT             9
3       4  Deepak         IT             9
4       5     Sam      Sales             8
5       6   mahak       None             9
6       7  garvit  Operatios             8
7       8     Sam      Sales             8

In [55]:
df.isnull().sum()

Emp_id          0
Name            1
Department      1
Working_hour    0
dtype: int64

In [56]:
# df.dropna()   ==> it is use to remove null values row
df

   Emp_id    Name Department  Working_hour
0       1     Sam         IT             8
1       2    None      Sales             9
2       3   Aditi         IT             9
3       4  Deepak         IT             9
4       5     Sam      Sales             8
5       6   mahak       None             9
6       7  garvit  Operatios             8
7       8     Sam      Sales             8

In [57]:
 df.dropna()

   Emp_id    Name Department  Working_hour
0       1     Sam         IT             8
2       3   Aditi         IT             9
3       4  Deepak         IT             9
4       5     Sam      Sales             8
6       7  garvit  Operatios             8
7       8     Sam      Sales             8